import { LocaleType } from './en'

export const ru: LocaleType = {
  Auth: {
    congratulations: 'Поздравляем!',
    doYouHaveAnAccount: 'Уже есть аккаунт?',
    dontHaveAnAccount: 'Нет аккаунта?',
    email: 'Email*',
    emailInvalidError: `Email должен быть формата
    example@example.com`,
    emailOrPasswordError: 'Неверный пароль или email',
    forgotPassword: 'Забыли пароль',
    emailIsNotValidOrAlreadyConfirmedError: 'Emali не валиден, или уже подтверждён',
    emailRequiredError: 'Введите email',
    emailSent: 'Письмо отправлено',
    emailTakenError: 'Пользователь с таким email уже зарегистрирован',
    emailVerificationLinkSentAgain: 'Письмо со ссылкой подтверждения повторно отправлено',
    logOut: 'Выйти',
    password: 'пароль',
    passwordConfirmation: 'подтвердите пароль',
    passwordConfirmationInvalidError: 'Пароли не совпадают',
    passwordConfirmationRequiredError: 'Подтвердите пароль',
    passwordInvalidError:
      'Пароль должен содержать a-z, A-Z,  ! " # $ % & \' ( ) * + , - . / : ; < = > ? @ [  ] ^ _` { | } ~',
    passwordNotStrongEnoughError:
      'Пароль должен содержать как минимум 1 специальный символ, 1 заглавную букву и 1 цифру',
    passwordRequiredError: 'Введите пароль',
    passwordTooLongError: 'Максимум 30 символов',
    passwordTooShortError: 'Минимум 6 символов',
    privacyPolicy: 'Я согласен с <1>Условиями</1> и <2>Политикой конфиденсальности</2>',
    privacyPolicyRequiredError: 'Заполните это поле',
    resendVerificationLink: 'Отправить новое письмо',
    signIn: 'Вход',
    signUp: 'Регистрация',
    username: 'Имя пользователя',
    usernameRequiredError: 'Введите имя пользователя',
    usernameTakenError: 'Пользователь с таким именем уже зарегестрирован',
    usernameTooLongError: 'Максимум 30 символов',
    usernameTooShortError: 'Минимум 6 символов',
    verificationLinkExpired: 'Ссылка не действительна',
    verificationLinkExpiredBody:
      'Ваша ссылка подтверждения более не действительна, не волнуйтесь, мы можем отправить новую',
    weSentALinkToConfirmYourEmail: 'Письмо со ссылкой для подтверждения email была отправлена на',
    yourEmailConfirmed: 'Ваш email успешно подтверждён',
  },
  Internationalization: {
    en: 'Английский',
    ru: 'Русский',
  },
<<<<<<< HEAD
  PrivacyPolicy: {
    text: `Целью настоящих Правил является обеспечение надлежащей защиты информации c пользователях,
     в том числе их персональных данных, от несанкционированного доступа и разглашения. Действующая 
     редакция Правил, являющихся публичным документом, доступна любому пользователю сети Интернет при
    переходе по ссылке. Администрация Сайта вправе вносить изменения в настоящие
    Правила. При внесении изменений в Правила Администрация Сайта уведомляет об этом пользователей 
    путем размещения новой редакции Правил на Сайте по постоянному адресу не 
    позднее, чем за 10 дней до вступления в силу соответствующих изменений. Предыдущие редакции Правил
    хранятся в архиве документации Администрации Сайта.Настоящие Правила разработаны и используются в
    соответствии c Правилами пользования сайтом, размещенными на Сайте по адресу.
    В случае наличия противоречий между настоящими Правилами и иными официальными документами Администрации
    Сайта применению подлежат настоящие Правила. Регистрируясь и используя Сайт, Пользователь выражает 
    свое согласие c условиями настоящих Правил.  В случае несогласия Пользователя с условиями настоящих 
    Правил использование Сайта и его сервисов должно быть немедленно прекращено. Если в соответствии с 
    законом требуется получение отдельного согласия Пользователя на обработку персональных данных в связи 
    с использованием Сайта, то такое согласие запрашивается у Пользователя только применительно к использованию
     Сайта. Запрос одного указанного согласия для всех социальных сетей и платформ социального взаимодействия не допускается.`,
    title: 'Политика конфиденциальности',
=======
  Navigation: {
    create: 'Создать',
    favorites: 'Избранное',
    home: 'Главная',
    messenger: 'Мессенджер',
    myProfile: 'Профиль',
    search: 'Поиск',
    statistics: 'Статистика',
>>>>>>> development
  },
}
